Revit 2026 API

# RebarSetCrankStraightLengthOverride Method

---

Sets the crank straight length at the indicated bar end as an override value.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetCrankStraightLengthOverride(
	int end,
	double crankStraightLength
)
```
```vb
Public Sub SetCrankStraightLengthOverride (
	end As Integer,
	crankStraightLength As Double
)
```
```cpp
public:
void SetCrankStraightLengthOverride(
	int end,
	double crankStraightLength
)
```
```fsharp
member SetCrankStraightLengthOverride :
        end : int *
        crankStraightLength : float -> unit
```

#### Parameters

end Int32
     The bar end.
crankStraightLength Double
     The crank straigth length.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | end must be 0 or 1. |
| InvalidOperationException | The bar does not have a valid Rebar Crank Type at the end. -or- The ability to override crank lengths is not enabled for this rebar instance. Use enableCrankLengthOverride(true) to enable it. |

When the crank straight length is set, the crank ratio is keeping the same value. The offset length and angled length are adjusted.

#### Reference

Rebar Class

Autodesk.Revit.DB.Structure Namespace